src/gena/transgen-mg-UAH-1.xml

<!--
in.operation 
Operation
1 Отправка
2 Получение - Выплата
    1 проводка 
    Дт 2809 (acc_direction=0) Кт 1002 
3 Аннулирование
4 Возврат
    2 проводки
    Дт 2809 Кт 1002 (acc_direction=1) Тело
    Дт 2809 Кт 1002 (acc_direction=1) Комиссия
-->

<!--
Moniker	                Flag	BranchId
280954601.980.050	    0	    1000550  для виплати переказу у гривні 
280964629781.980.050	1	    1000550  повернення комісії у гривні
100274241.980.050               1000550  Банкноти та монети в касі, В№050
-->

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <RegisterOperation xmlns="http://www.ukrgasbank.com">
            <TransferId>46833734</TransferId>
            <TransferNumber>40505184</TransferNumber>
            <SystemCode>mg</SystemCode>
            <SystemName>MoneyGram</SystemName>
            <Operation>2</Operation>
            <Type>1</Type>
            <OperationDate>2021-02-04T10:53:40+02:00</OperationDate>
            <PayoutDate>2021-02-04T10:51:29+02:00</PayoutDate>
            <OperationCashDesk>0</OperationCashDesk>
            <ABSDate>2021-02-04T00:00:00+02:00</ABSDate>
            <!-- 2809 - 1002 0 -->
            <TransferAmount>200.000</TransferAmount>
            <FromCountry>840</FromCountry>
            <ToCountry>804</ToCountry>
            <TransferСurrency>980</TransferСurrency>
            <PointBank>1000017</PointBank>
            <PointSW>GASB0204</PointSW>
            <UserLogin>nnilosh</UserLogin>
            <UserName>Нілош Ніколетт Тіберіївна</UserName>
            <UserID>13481</UserID>
            <Sender>

                    <LastName>VOZNIUK</LastName>
                    <FirstName>NATALIIA</FirstName>
                    <Residency>false</Residency>

                    <DocumentName>PASSAPORTO</DocumentName>
                    <DocumentSeries>EX</DocumentSeries>
                    <DocumentNumber>980622</DocumentNumber>
                    <DocumentIssueDate>2001-10-10</DocumentIssueDate>
                    <DocumentIssuedBy>GOVERNO</DocumentIssuedBy>

                    <DateofBirth>1985-09-05</DateofBirth>
                    <BirthPlace>место рождения</BirthPlace>

                    <Country>Ukraine</Country>
                    <Phone>0993334455</Phone>
                    <City>Kijow</City>
                    <ZipCode>02000</ZipCode>
                    <Address>Place 22, 45-222</Address>        

            </Sender>
            <Receiver>
                <LastName>DITYATKIN</LastName>
                <FirstName>DINIS</FirstName>
                <Residency>true</Residency>
                <DocumentName>Паспорт</DocumentName>
                <DocumentSeries>CE</DocumentSeries>
                <DocumentNumber>761321</DocumentNumber>
                <DocumentIssueDate>2016-08-26</DocumentIssueDate>
                <DocumentIssuedBy>IVANO-FRANKIVSKYM MV</DocumentIssuedBy>
                <DateofBirth>1986-02-05</DateofBirth>
            </Receiver>
        </RegisterOperation>
    </soap:Body>
</soap:Envelope>


<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <RegisterOperation xmlns="http://www.ukrgasbank.com">
            <TransferId>46635258</TransferId>
            <TransferNumber>16409942</TransferNumber>
            <SystemCode>mg</SystemCode>
            <SystemName>MoneyGram</SystemName>
            <Operation>4</Operation>
            <Type>1</Type>
            <OperationDate>2021-01-28T15:42:52+02:00</OperationDate>
            <SendDate>2021-01-20T13:08:55+02:00</SendDate>
            <OperationCashDesk>0</OperationCashDesk>
            <ABSDate>2021-01-28T00:00:00+02:00</ABSDate>
            <!-- 1002 - 2809 0 ??? -->
            <TransferAmount>200.000</TransferAmount>
            <FromCountry>804</FromCountry>
            <ToCountry>840</ToCountry>
            <TransferСurrency>980</TransferСurrency>
            <CommissionAmount>10.000</CommissionAmount>
            <CommissionСurrency>980</CommissionСurrency>
            <!-- 1002 - 2809 1 -->
            <CommissionAmountEq>10.000</CommissionAmountEq>
            <PointBank>1000550</PointBank>
            <PointSW>GASB0258</PointSW>
            <UserLogin>nnilosh</UserLogin>
            <UserName>Нілош Ніколетт Тіберіївна</UserName>
            <UserID>13481</UserID>
            <Sender>
                    <LastName>VOZNIUK</LastName>
                    <FirstName>NATALIIA</FirstName>
                    <Residency>false</Residency>

                    <DocumentName>PASSAPORTO</DocumentName>
                    <DocumentSeries>EX</DocumentSeries>
                    <DocumentNumber>980622</DocumentNumber>
                    <DocumentIssueDate>2001-10-10</DocumentIssueDate>
                    <DocumentIssuedBy>GOVERNO</DocumentIssuedBy>

                    <DateofBirth>1985-09-05</DateofBirth>
                    <BirthPlace>место рождения</BirthPlace>

                    <Country>Ukraine</Country>
                    <Phone>0993334455</Phone>
                    <City>Kijow</City>
                    <ZipCode>02000</ZipCode>
                    <Address>Place 22, 45-222</Address>        
            </Sender>
            <Receiver>
                <LastName>DANELIA</LastName>
                <FirstName>TAMARI</FirstName>
            </Receiver>
        </RegisterOperation>
    </soap:Body>
</soap:Envelope>
